Tekla Open API Reference for Tekla Structures 2025
PropertyElement.PropertyElementType.ViewLabelMarkPropertyElementTypes Class
 The ViewLabelMarkPropertyElementTypes class represents the available property element types for view label marks.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.PropertyElement.PropertyElementType.ViewLabelMarkPropertyElementTypes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public static class ViewLabelMarkPropertyElementTypes
<SerializableAttribute>
Public NotInheritable Class ViewLabelMarkPropertyElementTypes
The PropertyElement.PropertyElementType.ViewLabelMarkPropertyElementTypes type exposes the following members.
Methods
Name | Description
DrawingName
Returns the drawing name property element type.
Scale
Returns the scale property element type.
SourceDrawingName
Returns the source drawing name property element type.
SourceDrawingNameWhenMoved
Returns the source drawing name when moved property element type.
ViewName
Returns the view name property element type.
Top
See Also
Reference
Tekla.Structures.Drawing Namespace